Q1_Solitary_Wave_Submerged_Step_submission/case/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (0     0    0)      // 0
    (0     0.01 0)      // 1
    (0     0    0.05)   // 2
    (0     0.01 0.05)   // 3
    (0     0    0.25)   // 4
    (0     0.01 0.25)   // 5
    (7     0    0)      // 6
    (7     0.01 0)      // 7
    (7     0    0.05)   // 8
    (7     0.01 0.05)   // 9
    (7     0    0.25)   // 10
    (7     0.01 0.25)   // 11
    (8     0    0)      // 12
    (8     0.01 0)      // 13
    (8     0    0.05)   // 14
    (8     0.01 0.05)   // 15
    (8     0    0.25)   // 16
    (8     0.01 0.25)   // 17
    (14.2  0    0)      // 18
    (14.2  0.01 0)      // 19
    (14.2  0    0.05)   // 20
    (14.2  0.01 0.05)   // 21
    (14.2  0    0.25)   // 22
    (14.2  0.01 0.25)   // 23
);

blocks
(
    hex (0 6 7 1 2 8 9 3)          (560 1 20) simpleGrading (1 1 1)
    hex (2 8 9 3 4 10 11 5)        (560 1 80) simpleGrading (1 1 1)
    hex (8 14 15 9 10 16 17 11)    (80 1 80)  simpleGrading (1 1 1)
    hex (12 18 19 13 14 20 21 15)  (496 1 20) simpleGrading (1 1 1)
    hex (14 20 21 15 16 22 23 17)  (496 1 80) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 2 3 1)
            (2 4 5 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (18 20 21 19)
            (20 22 23 21)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 6 7 1)
            (6 8 9 7)
            (8 14 15 9)
            (12 14 15 13)
            (12 18 19 13)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 10 11 5)
            (10 16 17 11)
            (16 22 23 17)
        );
    }
    sides
    {
        type empty;
        faces
        (
            (0 6 8 2)
            (1 7 9 3)
            (2 8 10 4)
            (3 9 11 5)
            (8 14 16 10)
            (9 15 17 11)
            (12 18 20 14)
            (13 19 21 15)
            (14 20 22 16)
            (15 21 23 17)
        );
    }
);

mergePatchPairs ();

