Q1_Solitary_Wave_Submerged_Step_submission/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       222744;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       222844;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1176;
        startFace       222944;
    }
    top
    {
        type            patch;
        nFaces          1136;
        startFace       224120;
    }
    sides
    {
        type            empty;
        inGroups        1(empty);
        nFaces          224000;
        startFace       225256;
    }
)

// ************************************************************************* //
