Q1_Solitary_Wave_Submerged_Step_submission/case/constant/g
FoamFile
{
    format      ascii;
    class       uniformDimensionedVectorField;
    object      g;
}
dimensions      [0 1 -2 0 0 0 0];
value           (0 0 -9.81);

