Q1_Solitary_Wave_Submerged_Step_submission/case/constant/waveProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    object      waveProperties;
}

inlet
{
    alpha           alpha.water;
    waveModel       shallowWaterAbsorption;
    nPaddle         1;
}

outlet
{
    alpha           alpha.water;
    waveModel       shallowWaterAbsorption;
    nPaddle         1;
}

