Q1_Solitary_Wave_Submerged_Step_submission/case/0.orig/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    inlet
    {
        type            waveVelocity;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            waveVelocity;
        value           uniform (0 0 0);
    }
    ground
    {
        type            noSlip;
    }
    top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    sides
    {
        type            empty;
    }
}

