Q1_Solitary_Wave_Submerged_Step_submission/case/0.orig/alpha.water
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
dimensions      [0 0 0 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    ground
    {
        type            zeroGradient;
    }
    top
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    sides
    {
        type            empty;
    }
}

